openfoam/test_cases/CB4_ref_0/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs (
    "/home/openfoam/boundary_conditions/ptInletVelocity/libPtInletVelocity.so"
    "/home/openfoam/boundary_conditions/ptBoundaryDisplacement/libPtBoundaryDisplacement.so"
    "/home/openfoam/boundary_conditions/ptSurfaceVelocity/libPtSurfaceVelocity.so"
);

application     scalarPimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         10;

deltaT          5e-4;

writeControl    adjustable;

writeInterval   0.01;

purgeWrite      0;

writeFormat     binary;

writePrecision  8;

timeFormat      general;

timePrecision   8;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           1.0;

maxDeltaT       1.0e-3;
/*
functions
{
    sTransport100
    {
        type            scalarTransport;
        libs            ("libsolverFunctionObjects.so");
        enabled         true;
        writeControl    outputTime;
        writeInterval   1;
        field           s1;
        write           true;
        D 4.19665e-5;   //Sc = nu/D = 100
        resetOnStartUp  false;
        fvOptions{}
    }
    sTransport1000
    {
        type            scalarTransport;
        libs            ("libsolverFunctionObjects.so");
        enabled         true;
        writeControl    outputTime;
        writeInterval   1;
        field           s2;
        write           true;
        D 4.19665e-6;   //Sc = nu/D = 1000
        resetOnStartUp  false;
        fvOptions{}
    }
    sTransport10000
    {
        type            scalarTransport;
        libs            ("libsolverFunctionObjects.so");
        enabled         true;
        writeControl    outputTime;
        writeInterval   1;
        field           s3;
        write           true;
        D 4.19665e-7;   //Sc = nu/D = 10000
        resetOnStartUp  false;
        fvOptions{}
    }
}

*/
// ************************************************************************* //
